---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.AssemblyCodeTable
source: html/b854ad74-4c31-0b8a-1b2f-9825070159a8.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.AssemblyCodeTable Property

An external resource type representing assembly code data.

## Syntax (C#)
```csharp
public static ExternalResourceType AssemblyCodeTable { get; }
```